#!/bin/zsh

BLUE='\033[1;34m'
GREEN='\033[1;32m'
PURPLE='\033[1;35m'
DARK_BLUE='\033[0;34m'

DEFAULT='\033[0m'

echo
echo "${BLUE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
echo "${BLUE}━━━━━━━━━━━━━━━ 🧹 Clean... 🧹 ━━━━━━━━━━━━━━━${DEFAULT}"
echo "${BLUE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"

flutter clean 

echo "${DARK_BLUE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
echo "${DARK_BLUE}━━━━━━━━━━━━━━ 📚 Pub get... 📚 ━━━━━━━━━━━━━━${DEFAULT}"
echo "${DARK_BLUE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"

flutter pub get 

echo "${PURPLE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
echo "${PURPLE}━━━━━━━━━━━━ 📲 Pod install... 📲 ━━━━━━━━━━━━${DEFAULT}"
echo "${PURPLE}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
 
cd ios 
pod install --repo-update 
cd -

echo "${GREEN}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
echo "${GREEN}━━━━━━━━━━━━━━━━ 🎉 Done! 🎉 ━━━━━━━━━━━━━━━━━${DEFAULT}"
echo "${GREEN}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━${DEFAULT}"
echo
